MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAL176/mcu.h
#define _IPC23_ADCD36IS_POSITION                 0x00000018
#define _IPC23_ADCD36IS_MASK                     0x03000000
#define _IPC23_ADCD36IS_LENGTH                   0x00000002

#define _IPC23_ADCD36IP_POSITION                 0x0000001A
#define _IPC23_ADCD36IP_MASK                     0x1C000000
#define _IPC23_ADCD36IP_LENGTH                   0x00000003

#define _IPC23_w_POSITION                        0x00000000
#define _IPC23_w_MASK                            0xFFFFFFFF
#define _IPC23_w_LENGTH                          0x00000020

#define _IPC24_ADCD37IS_POSITION                 0x00000000
#define _IPC24_ADCD37IS_MASK                     0x00000003
#define _IPC24_ADCD37IS_LENGTH                   0x00000002

#define _IPC24_ADCD37IP_POSITION                 0x00000002
#define _IPC24_ADCD37IP_MASK                     0x0000001C
#define _IPC24_ADCD37IP_LENGTH                   0x00000003

#define _IPC24_ADCD38IS_POSITION                 0x00000008
#define _IPC24_ADCD38IS_MASK                     0x00000300
#define _IPC24_ADCD38IS_LENGTH                   0x00000002

#define _IPC24_ADCD38IP_POSITION                 0x0000000A
#define _IPC24_ADCD38IP_MASK                     0x00001C00
#define _IPC24_ADCD38IP_LENGTH                   0x00000003

#define _IPC24_ADCD39IS_POSITION                 0x00000010
#define _IPC24_ADCD39IS_MASK                     0x00030000
#define _IPC24_ADCD39IS_LENGTH                   0x00000002

#define _IPC24_ADCD39IP_POSITION                 0x00000012
#define _IPC24_ADCD39IP_MASK                     0x001C0000
#define _IPC24_ADCD39IP_LENGTH                   0x00000003

#define _IPC24_ADCD40IS_POSITION                 0x00000018
#define _IPC24_ADCD40IS_MASK                     0x03000000
#define _IPC24_ADCD40IS_LENGTH                   0x00000002

#define _IPC24_ADCD40IP_POSITION                 0x0000001A
#define _IPC24_ADCD40IP_MASK                     0x1C000000
#define _IPC24_ADCD40IP_LENGTH                   0x00000003

#define _IPC24_w_POSITION                        0x00000000
#define _IPC24_w_MASK                            0xFFFFFFFF
#define _IPC24_w_LENGTH                          0x00000020

#define _IPC25_ADCD41IS_POSITION                 0x00000000
#define _IPC25_ADCD41IS_MASK                     0x00000003
#define _IPC25_ADCD41IS_LENGTH                   0x00000002

#define _IPC25_ADCD41IP_POSITION                 0x00000002
#define _IPC25_ADCD41IP_MASK                     0x0000001C
#define _IPC25_ADCD41IP_LENGTH                   0x00000003

#define _IPC25_ADCD42IS_POSITION                 0x00000008
#define _IPC25_ADCD42IS_MASK                     0x00000300
#define _IPC25_ADCD42IS_LENGTH                   0x00000002

#define _IPC25_ADCD42IP_POSITION                 0x0000000A
#define _IPC25_ADCD42IP_MASK                     0x00001C00
#define _IPC25_ADCD42IP_LENGTH                   0x00000003

#define _IPC25_ADCD43IS_POSITION                 0x00000010
#define _IPC25_ADCD43IS_MASK                     0x00030000
#define _IPC25_ADCD43IS_LENGTH                   0x00000002

#define _IPC25_ADCD43IP_POSITION                 0x00000012
#define _IPC25_ADCD43IP_MASK                     0x001C0000
#define _IPC25_ADCD43IP_LENGTH                   0x00000003

#define _IPC25_USBSRIS_POSITION                  0x00000018
#define _IPC25_USBSRIS_MASK                      0x03000000
#define _IPC25_USBSRIS_LENGTH                    0x00000002

#define _IPC25_USBSRIP_POSITION                  0x0000001A
#define _IPC25_USBSRIP_MASK                      0x1C000000
#define _IPC25_USBSRIP_LENGTH                    0x00000003

#define _IPC25_w_POSITION                        0x00000000
#define _IPC25_w_MASK                            0xFFFFFFFF
#define _IPC25_w_LENGTH                          0x00000020

#define _IPC26_CPCIS_POSITION                    0x00000000
#define _IPC26_CPCIS_MASK                        0x00000003
#define _IPC26_CPCIS_LENGTH                      0x00000002

#define _IPC26_CPCIP_POSITION                    0x00000002
#define _IPC26_CPCIP_MASK                        0x0000001C
#define _IPC26_CPCIP_LENGTH                      0x00000003

#define _IPC26_CFDCIS_POSITION                   0x00000008
#define _IPC26_CFDCIS_MASK                       0x00000300
#define _IPC26_CFDCIS_LENGTH                     0x00000002

#define _IPC26_CFDCIP_POSITION                   0x0000000A
#define _IPC26_CFDCIP_MASK                       0x00001C00
#define _IPC26_CFDCIP_LENGTH                     0x00000003

#define _IPC26_SBIS_POSITION                     0x00000010
#define _IPC26_SBIS_MASK                         0x00030000
#define _IPC26_SBIS_LENGTH                       0x00000002

#define _IPC26_SBIP_POSITION                     0x00000012
#define _IPC26_SBIP_MASK                         0x001C0000
#define _IPC26_SBIP_LENGTH                       0x00000003

#define _IPC26_CRPTIS_POSITION                   0x00000018
#define _IPC26_CRPTIS_MASK                       0x03000000
#define _IPC26_CRPTIS_LENGTH                     0x00000002

#define _IPC26_CRPTIP_POSITION                   0x0000001A
#define _IPC26_CRPTIP_MASK                       0x1C000000
#define _IPC26_CRPTIP_LENGTH                     0x00000003

#define _IPC26_w_POSITION                        0x00000000
#define _IPC26_w_MASK                            0xFFFFFFFF
#define _IPC26_w_LENGTH                          0x00000020

#define _IPC27_SPI1EIS_POSITION                  0x00000008
#define _IPC27_SPI1EIS_MASK                      0x00000300
#define _IPC27_SPI1EIS_LENGTH                    0x00000002

#define _IPC27_SPI1EIP_POSITION                  0x0000000A
#define _IPC27_SPI1EIP_MASK                      0x00001C00
#define _IPC27_SPI1EIP_LENGTH                    0x00000003

#define _IPC27_SPI1RXIS_POSITION                 0x00000010
#define _IPC27_SPI1RXIS_MASK                     0x00030000
#define _IPC27_SPI1RXIS_LENGTH                   0x00000002

#define _IPC27_SPI1RXIP_POSITION                 0x00000012
#define _IPC27_SPI1RXIP_MASK                     0x001C0000
#define _IPC27_SPI1RXIP_LENGTH                   0x00000003

#define _IPC27_SPI1TXIS_POSITION                 0x00000018
#define _IPC27_SPI1TXIS_MASK                     0x03000000
#define _IPC27_SPI1TXIS_LENGTH                   0x00000002

#define _IPC27_SPI1TXIP_POSITION                 0x0000001A
#define _IPC27_SPI1TXIP_MASK                     0x1C000000
#define _IPC27_SPI1TXIP_LENGTH                   0x00000003

#define _IPC27_w_POSITION                        0x00000000
#define _IPC27_w_MASK                            0xFFFFFFFF
#define _IPC27_w_LENGTH                          0x00000020

#define _IPC28_U1EIS_POSITION                    0x00000000
#define _IPC28_U1EIS_MASK                        0x00000003
#define _IPC28_U1EIS_LENGTH                      0x00000002

#define _IPC28_U1EIP_POSITION                    0x00000002
#define _IPC28_U1EIP_MASK                        0x0000001C
#define _IPC28_U1EIP_LENGTH                      0x00000003

#define _IPC28_U1RXIS_POSITION                   0x00000008
#define _IPC28_U1RXIS_MASK                       0x00000300
#define _IPC28_U1RXIS_LENGTH                     0x00000002

#define _IPC28_U1RXIP_POSITION                   0x0000000A
#define _IPC28_U1RXIP_MASK                       0x00001C00
#define _IPC28_U1RXIP_LENGTH                     0x00000003

